[
    {
      "title": "MetaDragonBoat: Exploring Paddling Techniques of Virtual Dragon Boating in a Metaverse Campus",
      "authors": "W He, X Li, S Xu, <span class=\"custom-bold\">Y Chen</span>, CI Sio, GL Kan, LH Lee (SIGMM '24)",
      "pdfLink": "#",
      "videoLink": "#",
      "doiLink": "#",
      "imageSrc": "images/teaser_meta_dragon_boat.jpg",
      "abstract": "The preservation of cultural heritage, as mandated by the United Nations Sustainable Development Goals (SDGs), is integral to sustainable urban development. This paper focuses on the Dragon Boat Festival, a prominent event in Chinese cultural heritage, and proposes leveraging Virtual Reality (VR), to enhance its preservation and accessibility. Traditionally, participation in the festival's dragon boat races was limited to elite athletes, excluding broader demographics. Our proposed solution, named MetaDragonBoat, enables virtual participation in dragon boat racing, offering immersive experiences that replicate physical exertion through a cultural journey. Thus, we build a digital twin of a university campus located in a region with a rich dragon boat racing tradition. Coupled with three paddling techniques that are enabled by either commercial controllers or physical paddle controllers with haptic feedback, diversified users can engage in realistic rowing experiences. Our results demonstrate that by integrating resistance into the paddle controls, users could simulate the physical effort of dragon boat racing, promoting a deeper understanding and appreciation of this cultural heritage.",
      "//remark": "🏅 Honorable Mention Award at CHI 2024"
    },
    {
      "title": "Hearing the Moment with MetaEcho! From Physical to Virtual in Synchronized Sound Recording",
      "authors": "Z Wei, <span class=\"custom-bold\">Y Chen</span>, W Tong, X Zong, H Qu, X Xu, LH Lee (SIGMM '24)",
      "pdfLink": "#",
      "videoLink": "#",
      "doiLink": "#",
      "imageSrc": "images/teaser_meta_echo.png",
      "abstract": "In film education, high expenses and limited space significantly challenge teaching synchronized sound recording (SSR). Traditional methods, which emphasize theory with limited practical experience, often fail to bridge the gap between theoretical understanding and practical application. As such, we introduce MetaEcho, an educational virtual reality leveraging the presence theory for teaching SSR. MetaEcho provides realistic simulations of various recording equipment and facilitates communication between learners and instructors, offering an immersive learning experience that closely mirrors actual practices. An evaluation with 24 students demonstrated that MetaEcho surpasses the traditional method in presence, collaboration, usability, realism, comprehensibility, and creativity. Three experts also commented on the benefits of MetaEcho and the opportunities for promoting SSR education in the metaverse era."
    }
]
  